app/controllers/users_controller.rb

SELECT "civilites".* FROM "civilites"
SELECT "genders".* FROM "genders"
SELECT "regions".* FROM "regions"
SELECT "cities".* FROM "cities"
SELECT "maritals".* FROM "maritals"
SELECT "diplomas".* FROM "diplomas"
SELECT "domains".* FROM "domains"
SELECT "contracts".* FROM "contracts"
---
	def new
		@user = User.new
		@civilite = Civilite.all
		@gender = Gender.all
		@region = Region.all
		@city = City.all
		@marital = Marital.all
		@diploma = Diploma.all
		@domain = Domain.all
		@contract = Contract.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = 1 LIMIT 1
SELECT "genders".* FROM "genders" WHERE "genders"."id" = 1 LIMIT 1
SELECT "regions".* FROM "regions" WHERE "regions"."id" = 1 LIMIT 1
SELECT "civilites".* FROM "civilites" WHERE "civilites"."id" = 2 LIMIT 1
SELECT "maritals".* FROM "maritals" WHERE "maritals"."id" = 1 LIMIT 1
SELECT "diplomas".* FROM "diplomas" WHERE "diplomas"."id" = 1 LIMIT 1
SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" IS NULL LIMIT 1
INSERT INTO "users" ("civilite", "first_name", "last_name", "email", "sex", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "birthdate", "birthplace", "current_nationality", "region_of_residence", "city_of_residence", "mobile_number", "fix_number", "postal_address", "marital_status", "number_of_children", "diploma", "school", "graduation_year", "domain", "job", "job_description", "employer", "contract_type", "cv_file_name", "cv_content_type", "cv_file_size", "cv_updated_at", "created_at", "updated_at") VALUES (NULL, 'trt', 'rtrt', 'rtrt', NULL, NULL, NULL, NULL, NULL, NULL, '', '', NULL, NULL, NULL, NULL, '', NULL, NULL, NULL, '', '2011-11-14', NULL, '', '', '', NULL, NULL, NULL, NULL, NULL, '2011-11-14 03:54:36.267367', '2011-11-14 03:54:36.267367') RETURNING "id"
SELECT "cities".* FROM "cities"
SELECT "civilites".* FROM "civilites"
SELECT "contracts".* FROM "contracts"
SELECT "diplomas".* FROM "diplomas"
---
	def create
		#require 'fileutils'
		@user = User.new( params[:user] )
		@city = City.find_by_id(params[:post][:city_id]).name
    @gender = Gender.find_by_id(params[:post][:gender_id]).title
    @region = Region.find_by_id(params[:post][:region_id]).name
    @civilite = Civilite.find_by_id(params[:post][:civilite_id].to_i).title
    @marital = Marital.find_by_id(params[:post][:marital_id]).status
    @diploma = Diploma.find_by_id(params[:post][:diploma_id]).title
    @domain = Domain.find_by_id(params[:post][:domain_id]).title
    @contract = Contract.find_by_id(params[:post][:contract_id]).title
    @birthdate = Date.new(params[:user][:"birthdate(1i)"].to_i, params[:user][:"birthdate(2i)"].to_i, params[:user][:"birthdate(3i)"].to_i)
    @graduation_year = Date.new(params[:user][:"graduation_year(1i)"].to_i, params[:user][:"graduation_year(2i)"].to_i, params[:user][:"graduation_year(3i)"].to_i)

    #@user = User.create( params[:user] )
  	#@tmp = params[:user][:avatar].tempfile
    #@file = File.join("public", params[:user][:avatar].original_filename)
    #FileUtils.cp @tmp.path.to_s, '/home/duke/Desktop/rails_projects/SoroGuillaume/public', @file#@tmp.path, @file

    respond_to do |format|
      if @user.save
        User.update_attributes(:civilite => @civilite,:first_name => @user.first_name, :last_name => @user.last_name, :email => @user.email, :sex => @gender, :birthdate => @birthdate, :birthplace => @user.birthplace, :current_nationality => @user.current_nationality, :region_of_residence => @region, :city_of_residence => @city,  :mobile_number => @user.mobile_number,
:fix_number => @user.fix_number, :postal_address => @user.postal_address, :marital_status => @marital, :number_of_children => @user.number_of_children, :diploma => @diploma, :school => @user.school, :graduation_year => @graduation_year, :domain => @domain, :job => @user.job, :job_description => @user.job_description, :employer => @user.employer, :contract_type => @contract)